soapRequest/borrowMusic.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:borrowMusicRequest>
            <gs:id>2</gs:id>
            <gs:username>hugo</gs:username>
        </gs:borrowMusicRequest>
    </soapenv:Body>
</soapenv:Envelope>